In [1]:
import pandas as pd

In [2]:
data = {"names": ["soyul", "soyul", "soyul", "Charles", "Charles"], "year": [2014, 2015, 2016, 2015, 2016], "points": [1.5, 1.7, 3.6, 2.4, 2.9]} 
df = pd.DataFrame(data, columns=["year", "names", "points", "penalty"], index = ["one", "two", "three", "four", "five"])

In [3]:
df

       year    names  points penalty
one    2014    soyul     1.5     NaN
two    2015    soyul     1.7     NaN
three  2016    soyul     3.6     NaN
four   2015  Charles     2.4     NaN
five   2016  Charles     2.9     NaN

In [4]:
# select row
df.loc["two"]

year        2015
names      soyul
points       1.7
penalty      NaN
Name: two, dtype: object

In [5]:
df.loc["two":"four"]

       year    names  points penalty
two    2015    soyul     1.7     NaN
three  2016    soyul     3.6     NaN
four   2015  Charles     2.4     NaN

In [6]:
df.iloc[1]

year        2015
names      soyul
points       1.7
penalty      NaN
Name: two, dtype: object

In [7]:
df.iloc[1:4]

       year    names  points penalty
two    2015    soyul     1.7     NaN
three  2016    soyul     3.6     NaN
four   2015  Charles     2.4     NaN

In [8]:
# select row, column
df.loc["two":"three", "year":"points"]

       year  names  points
two    2015  soyul     1.7
three  2016  soyul     3.6

In [9]:
df.iloc[1:3, 0:3]

       year  names  points
two    2015  soyul     1.7
three  2016  soyul     3.6

In [10]:
df.iloc[[0,1,3], [1,2]]

        names  points
one     soyul     1.5
two     soyul     1.7
four  Charles     2.4

In [11]:
# select row by condition
df.loc[(df["names"] == "soyul") & (df["points"] < 3), :]

     year  names  points penalty
one  2014  soyul     1.5     NaN
two  2015  soyul     1.7     NaN